Revit.GeometryConversion.CurveUtils.CurvesAreSimilar(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.Curve)
This method uses basic checks to compare curves for similarity.
It starts by comparing the curves' end points. Curves which have similar
end points but different directions will not be regarded as similar,
because directionality is important in Revit for other purposes.
Depending on the curve type, other comparisons are then performed.
a: The first curve.
b: The second curve.
Returns: Returns true if the curves are similar within Tolerance, and
false if they are not.

Revit.GeometryConversion.CurveUtils.CurvesHaveSameEndpoints(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.Curve,System.Double)
but are reversed are not considered similar.